---
kind: property
id: P:Autodesk.Revit.DB.Material.MaterialClass
zh: 材质、材料
source: html/ad8d658d-736a-f89c-981a-555f0d69c2e5.htm
---
# Autodesk.Revit.DB.Material.MaterialClass Property

**中文**: 材质、材料

The name of the general material type, e.g. 'Wood.'

## Syntax (C#)
```csharp
public string MaterialClass { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null